<?php
						// Лекция 8 
		//часы - по текущему времени сформировать стрелочные часы
$sec = (int)date('s'); //получить дату, взять только секунды, пиревести в целое цначение
$sec = 53; //переобозначили
echo $sec . PHP_EOL;
$tablo = []; //матрица(массив строк)
$tablo[] = '\\\\\\\\\\\\||||//////';	//каждую \ из 6-ти заэкранировали
$tablo[] = '\              /';
$tablo[] = '\              /';
$tablo[] = '\              /';
$tablo[] = '\              /';
$tablo[] = '\              /';
$tablo[] = '-              -';
$tablo[] = '-      ┌┐      -';
$tablo[] = '-      └┘      -';
$tablo[] = '-              -';
$tablo[] = '/              \\';
$tablo[] = '/              \\';
$tablo[] = '/              \\';
$tablo[] = '/              \\';
$tablo[] = '/              \\';
$tablo[] = '//////||||\\\\\\\\\\\\';

$side = (floor(($sec + 8) / 15)) % 4; //для определение стороны(ребра часов)
// 8 -это количество черточек, равное половине черточек каждой стороны
// 4 - кол-во сторон
// 15 - кол-во (черточек минус 1) каждой стороны
echo $side;
//$i //строка
//$k //столбец
switch ($side) {
	case 0:
		$i=0;
		//$sec +8 = от 61 до 68 и от 9 до 16
		$k = ($sec +8)%60 -1;
		break;
}
$tablo_out[$i][$k] = $tablo[$i][$k];

echo "<pre>";

// foreach ($tablo as $key => $row) { //каждую строку представить как ключ - значение
//  									//$key - это индекс массива(ключ),а $row - каждая строка(значение)
//  	//echo $key." : ".$row."<br>";
//  	echo $row."<br>";
// }

//echo print_r($tablo, true);

// $tablo_out = [];
// for ($i=0;$i<16;$i++) {
// 	for ($k=0; $k<16; $k++){
// 		$tablo_out[$i][$k];
// 	}
// }

foreach ($tablo_out as $key => $row) {
	foreach ($row as $symb) {
		echo $symb;
	}
	//echo $key." : ".$row."<br>";
	//echo $row."<br>";
	echo PHP_EOL;
}

echo "</pre>";
?>